{
    "name": "Summon Card",
    "icon": "pvz:pea_shooter_card",
    "category": "pvz:intro",
    "pages": [
        {
            "type": "text",
            "text": "$(bred)Summon Card$() is the link between players and creatures. Players can summon the corresponding creature by $(l)right click Summon Card on the ground$() while consuming $(byellow)SunNum$()(some cards is right-clicking the water surface). Currently, the only kind of creature that can be summoned by Summon Card is plant type $(m)(zombies may be added in later updates)$()."
        },
        {
            "type": "text",
            "text": "There is an unlocking mechanism for summon card, and many cards are not unlocked when the player's tree level is insufficient. Unlock paths are upgrades, challenge rewards or command.<br>Summon card is After player $(l)use card$() to summon a creature, $(bred)the creature will treat the player as its owner$()."
        },
        {
            "type": "spotlight",
            "item": "pvz:jalapeno_card",
            "title": "Common Card",
            "text": "$(l)Maximum stack size: 1$()$(br)Can $(bpurple)enchant$()$(br)Long $(baqua)CoolDown$()$(br)Unlimited use$(br)$()The color of card frame is related to its rank."
        },
        {
            "type": "spotlight",
            "item": "pvz:jalapeno_enjoy_card",
            "title": "Enjoy Card",
            "text": "$(l)Maximum stack size: 16$()$(br)Can't $(bpurple)enchant$()$(br)1s $(baqua)CoolDown$()$(br)Can only be used once$(br)$()The color of card frame is wood."
        },
        {
            "type": "text",
            "text": "After 0.6 version, the card placement becomes more strict. Only 50 plants can be planted within 30 blocks, after that every 5 more sun cost will be doubled. Densely planting enchantment can slow down this situation."
        },
        {
            "type": "text",
            "text": "The previous two pages introduced the difference between $(bred)Common Summon Cards and Enjoy Cards$(), and their acquisition is actually different. Common Cards are generally obtained by $(bred)crafting or purchase$(), while Enjoy Cards are often obtained by opening $(bred)treasure chests or lottery or finish invasion$()."
        }
    ],
    "advancement": "pvz:adventure/root",
    "sortnum": 4
}