{
    "name": "Zombie Invade",
    "icon": "pvz:zombie_flag",
    "category": "pvz:intro",
    "pages": [
        {
            "type": "text",
            "text": "Maybe you haven't encountered zombies yet, but it doesn't mean that there are no zombies. $(bred)Strange help$() didn't lie to you. From the beginning of the creation of the world, there is a $(bred)SafeDayLength$(). The default SafeDayLength is $(l)2 game days$(), after which $(red)invasion will occur every 2 day in OverWorld$(). they can be modified in the config file."
        },
        {
            "type": "text",
            "text": "$(bred)Invasions$() are based on $(l)days$(). If there is a sign $(bred)<Zombies are coming>$() in the morning, it means that the invasion has begun and it will continue until the end of the day. Zombie Invasion contains various of events, $(bred)Events$() can divided into two types(Spawn Events, Assist Events)."
        },
        {
            "type": "text",
            "text": "Overworld will spawn various of zombies in that day. There is $(bred)only one Spawn Events$() in each Invasion day, it determines what kind of zombies will spawn in $(l)Overworld$().there may be also some $(l)Assist events$(), which can $(bred)enhance zombies or change the environment$()."
        },
        {
            "type": "text",
            "text": "when invasion start, you will see a $(bred)invasion progress$() in the $(l)lower right corner$(), it will tip you when will wave start. The higher the $(bgreen)TreeLevel$() is, the more waves player may encounter. You will see <$(bred)A huge wave of zombies are coming$()> when wave is spawned.$(br)some zombie invasion teams will spawn surround players in 48 blocks, If you dislike the waves, you can turn off in config file."
        },
        {
            "type": "text",
            "text": "Every Invasion day will randomly give mission to players, including kill invaders, collect sun, instant kill. All Mission have several stage, finish each of stage will get rewards like $(l)Money, Jewel, Lottery Chance$().$(br)"
        }
    ],
    "advancement": "pvz:adventure/root",
    "sortnum": 5
}