{
    "name": "Zombies and Plants",
    "icon": "minecraft:zombie_head",
    "category": "pvz:intro",
    "pages": [
        {
            "type": "text",
            "text": "$(bpurple)Zombies$() are crazy creatures that feed on brains. $(l)They are enemies with plants and also attack players and Crazy Dave$(). There are many types of zombies, some can walk on the road; some can drive a car, some can dive in the sea, there are even zombies that can ride a dolphin."
        },
        {   
            "type": "text",
            "text": "There are various rewards for killing zombies, players can get $(bgreen)TreeXp$() by killing zombies, and players can get $(bgreen)PlantXp$() when their plants killed zombies. Zombies have chances to drop $(borange)Coins(copper coins, silver coins, gold coins)$(), $(bblue)Gems$(), and $(borange)Chocolate$(). If you kill a zombie surrounded by $(bgreen)green light$(), it will definitely drop $(l)Energy$()."
        },
        {   
            "type": "text",
            "text": "$(bgreen)Plants$() are creatures that $(l)are hostile to zombies and $(bred)all kinds of monsters$(). Different plants have different usages. Some can produce sun, such as SunFlowers. Some can attack enemies, such as PeaShooters. Some can defend, such as NutWalls."
        },
        {   
            "type": "text",
            "text": "$(bgreen)Plants$() are relatively fragile. Terrestrial plants can only survive on $(l)grass blocks and Water lilies$(), while aquatic plants can only survive $(l)in water$(). In addition, $(l)common plants can only survive up to 24000 ticks$(), which can be changed in the config file($(red)upgrade plants can live twice longer than common one$())."
        },
        {
            "type": "text",
            "text": "Both $(l)plants and zombies$() have $(bred)qualities$(). The qualities are $(bred)gray, white, green, blue, purple, gold, and red$(), which become higher from left to right. The higher the quality, the stronger the corresponding plants or zombies. $(l)More experience gained from killing high-quality zombies$(). For plants, $(l)the higher the quality, the more difficult it is to upgrade$()."
        }
    ],
    "advancement": "pvz:root",
    "sortnum": 1
}